QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/xbar.h
#ifndef XBAR_H
#define XBAR_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

//*****************************************************************************
//
//! \addtogroup xbar_api XBAR
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_epwmxbar.h"
#include "inc/hw_inputxbar.h"
#include "inc/hw_outputxbar.h"
#include "inc/hw_xbar.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

//*****************************************************************************
//
// Useful defines used within the driver functions.
// Not intended for use by application code.
//
//*****************************************************************************
#define XBAR_OUTPUT_CFG_REG_BASE (OUTPUTXBAR_BASE + XBAR_O_OUTPUT1MUX0TO15CFG)
#define XBAR_OUTPUT_EN_REG_BASE  (OUTPUTXBAR_BASE + XBAR_O_OUTPUT1MUXENABLE)
#define XBAR_EPWM_CFG_REG_BASE   (EPWMXBAR_BASE + XBAR_O_TRIP4MUX0TO15CFG)
#define XBAR_EPWM_EN_REG_BASE    (EPWMXBAR_BASE + XBAR_O_TRIP4MUXENABLE)
#define XBAR_INPUT_BASE          (INPUTXBAR_BASE + XBAR_O_INPUT1SELECT)

#define XBAR_INPUT_FLG_INPUT_M 0x00FFU
#define XBAR_INPUT_FLG_REG_M   0xFF00U
#define XBAR_INPUT_FLG_REG_1   0x0000U
#define XBAR_INPUT_FLG_REG_2   0x0100U
#define XBAR_INPUT_FLG_REG_3   0x0200U
#define XBAR_INPUT_FLG_REG_4   0x0300U

#define XBAR_GPIO_MAX_CNT     120U
#define XBAR_GPIO_AIO_MIN_CNT 224U
#define XBAR_GPIO_AIO_MAX_CNT 247U
#define XBAR_NON_GPIO_MIN_CNT 0xFFFDU
#define XBAR_NON_GPIO_MAX_CNT 0xFFFFU

#ifndef DOXYGEN_PDF_IGNORE
//*****************************************************************************
//
// The following values define the muxes parameter for XBAR_enableEPWMMux(),
// XBAR_enableOutputMux(), XBAR_disableEPWMMux(), and
// XBAR_disableOutputMux().
//
//*****************************************************************************
#define XBAR_MUX00 0x00000001U //!< Mask for X-BAR mux 0
#define XBAR_MUX01 0x00000002U //!< Mask for X-BAR mux 1
#define XBAR_MUX02 0x00000004U //!< Mask for X-BAR mux 2
#define XBAR_MUX03 0x00000008U //!< Mask for X-BAR mux 3
#define XBAR_MUX04 0x00000010U //!< Mask for X-BAR mux 4
#define XBAR_MUX05 0x00000020U //!< Mask for X-BAR mux 5
#define XBAR_MUX06 0x00000040U //!< Mask for X-BAR mux 6
#define XBAR_MUX07 0x00000080U //!< Mask for X-BAR mux 7
#define XBAR_MUX08 0x00000100U //!< Mask for X-BAR mux 8
#define XBAR_MUX09 0x00000200U //!< Mask for X-BAR mux 9
#define XBAR_MUX10 0x00000400U //!< Mask for X-BAR mux 10
#define XBAR_MUX11 0x00000800U //!< Mask for X-BAR mux 11
#define XBAR_MUX12 0x00001000U //!< Mask for X-BAR mux 12
#define XBAR_MUX13 0x00002000U //!< Mask for X-BAR mux 13
#define XBAR_MUX14 0x00004000U //!< Mask for X-BAR mux 14
#define XBAR_MUX15 0x00008000U //!< Mask for X-BAR mux 15
#define XBAR_MUX16 0x00010000U //!< Mask for X-BAR mux 16
#define XBAR_MUX17 0x00020000U //!< Mask for X-BAR mux 17
#define XBAR_MUX18 0x00040000U //!< Mask for X-BAR mux 18
#define XBAR_MUX19 0x00080000U //!< Mask for X-BAR mux 19
#define XBAR_MUX20 0x00100000U //!< Mask for X-BAR mux 20
#define XBAR_MUX21 0x00200000U //!< Mask for X-BAR mux 21
#define XBAR_MUX22 0x00400000U //!< Mask for X-BAR mux 22
#define XBAR_MUX23 0x00800000U //!< Mask for X-BAR mux 23
#define XBAR_MUX24 0x01000000U //!< Mask for X-BAR mux 24
#define XBAR_MUX25 0x02000000U //!< Mask for X-BAR mux 25
#define XBAR_MUX26 0x04000000U //!< Mask for X-BAR mux 26
#define XBAR_MUX27 0x08000000U //!< Mask for X-BAR mux 27
#define XBAR_MUX28 0x10000000U //!< Mask for X-BAR mux 28
#define XBAR_MUX29 0x20000000U //!< Mask for X-BAR mux 29
#define XBAR_MUX30 0x40000000U //!< Mask for X-BAR mux 30
#define XBAR_MUX31 0x80000000U //!< Mask for X-BAR mux 31
#endif

//*****************************************************************************
//
//! The following values define the \e output parameter for
//! XBAR_setOutputMuxConfig(), XBAR_enableOutputMux(), and
//! XBAR_disableOutputMux().
//
//*****************************************************************************
typedef enum
{
    XBAR_OUTPUT1 = 0x00, //!< OUTPUT1 of the Output X-BAR
    XBAR_OUTPUT2 = 0x04, //!< OUTPUT2 of the Output X-BAR
    XBAR_OUTPUT3 = 0x08, //!< OUTPUT3 of the Output X-BAR
    XBAR_OUTPUT4 = 0x0C, //!< OUTPUT4 of the Output X-BAR
    XBAR_OUTPUT5 = 0x10, //!< OUTPUT5 of the Output X-BAR
    XBAR_OUTPUT6 = 0x14, //!< OUTPUT6 of the Output X-BAR
    XBAR_OUTPUT7 = 0x18, //!< OUTPUT7 of the Output X-BAR
    XBAR_OUTPUT8 = 0x1C, //!< OUTPUT8 of the Output X-BAR
} XBAR_OutputNum;

//*****************************************************************************
//
//! The following values define the \e trip parameter for
//! XBAR_setEPWMMuxConfig(), XBAR_invertEPWMSignal(), XBAR_enableEPWMMux(),
//! and XBAR_disableEPWMMux().
//
//*****************************************************************************
typedef enum
{
    XBAR_TRIP4  = 0x00, //!< TRIP4 of the ePWM X-BAR
    XBAR_TRIP5  = 0x04, //!< TRIP5 of the ePWM X-BAR
    XBAR_TRIP7  = 0x08, //!< TRIP7 of the ePWM X-BAR
    XBAR_TRIP8  = 0x0C, //!< TRIP8 of the ePWM X-BAR
    XBAR_TRIP9  = 0x10, //!< TRIP9 of the ePWM X-BAR
    XBAR_TRIP10 = 0x14, //!< TRIP10 of the ePWM X-BAR
    XBAR_TRIP11 = 0x18, //!< TRIP11 of the ePWM X-BAR
    XBAR_TRIP12 = 0x1C  //!< TRIP12 of the ePWM X-BAR
} XBAR_TripNum;

//*****************************************************************************
//
// The following values define the trip parameter for XBAR_setCLBMuxConfig(),
// XBAR_enableCLBMux(), and XBAR_disableCLBMux().
//
//*****************************************************************************
typedef enum
{
    XBAR_AUXSIG0 = 0x00,
    XBAR_AUXSIG1 = 0x04,
    XBAR_AUXSIG2 = 0x08,
    XBAR_AUXSIG3 = 0x0C,
    XBAR_AUXSIG4 = 0x10,
    XBAR_AUXSIG5 = 0x14,
    XBAR_AUXSIG6 = 0x18,
    XBAR_AUXSIG7 = 0x1C
} XBAR_AuxSigNum;

//*****************************************************************************
//
//! The following values define the \e input parameter for XBAR_setInputPin().
//
//*****************************************************************************
typedef enum
{
    XBAR_INPUT1,  //!< ePWM[TZ1], ePWM[TRIP1], X-BARs, eCAPs
    XBAR_INPUT2,  //!< ePWM[TZ2], ePWM[TRIP2], X-BARs, eCAPs
    XBAR_INPUT3,  //!< ePWM[TZ3], ePWM[TRIP3], X-BARs, eCAPs
    XBAR_INPUT4,  //!< ADC wrappers, X-BARs, XINT1, eCAPs
    XBAR_INPUT5,  //!< EXTSYNCIN1, X-BARs, XINT2, eCAPs
    XBAR_INPUT6,  //!< EXTSYNCIN2, ePWM[TRIP6], X-BARs, XINT3, eCAPs
    XBAR_INPUT7,  //!< X-BARs, eCAPs
    XBAR_INPUT8,  //!< X-BARs, eCAPs
    XBAR_INPUT9,  //!< X-BARs, eCAPs
    XBAR_INPUT10, //!< X-BARs, eCAPs
    XBAR_INPUT11, //!< X-BARs, eCAPs
    XBAR_INPUT12, //!< X-BARs, eCAPs
    XBAR_INPUT13, //!< XINT4, X-BARs, eCAPs
    XBAR_INPUT14, //!< XINT5, X-BARs, eCAPs
    XBAR_INPUT15, //!< eCAPs
    XBAR_INPUT16  //!< eCAPs
} XBAR_InputNum;

