QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/xbar.h
#ifndef DOXYGEN_PDF_IGNORE
//*****************************************************************************
//
//! The following values define the \e muxConfig parameter for
//! XBAR_setOutputMuxConfig().
//
//*****************************************************************************
typedef enum
{
    //
    // OUTPUTXBAR
    //
    XBAR_OUT_MUX00_CMPSS1_CTRIPOUTH       = 0x0000,
    XBAR_OUT_MUX00_CMPSS1_CTRIPOUTH_OR_L  = 0x0001,
    XBAR_OUT_MUX00_ADCAEVT1               = 0x0002,
    XBAR_OUT_MUX00_ECAP1_OUT              = 0x0003,
    XBAR_OUT_MUX01_CMPSS1_CTRIPOUTL       = 0x0200,
    XBAR_OUT_MUX01_INPUTXBAR1             = 0x0201,
    XBAR_OUT_MUX01_ADCCEVT1               = 0x0203,
    XBAR_OUT_MUX02_CMPSS2_CTRIPOUTH       = 0x0400,
    XBAR_OUT_MUX02_CMPSS2_CTRIPOUTH_OR_L  = 0x0401,
    XBAR_OUT_MUX02_ADCAEVT2               = 0x0402,
    XBAR_OUT_MUX02_ECAP2_OUT              = 0x0403,
    XBAR_OUT_MUX03_CMPSS2_CTRIPOUTL       = 0x0600,
    XBAR_OUT_MUX03_INPUTXBAR2             = 0x0601,
    XBAR_OUT_MUX03_ADCCEVT2               = 0x0603,
    XBAR_OUT_MUX04_CMPSS3_CTRIPOUTH       = 0x0800,
    XBAR_OUT_MUX04_CMPSS3_CTRIPOUTH_OR_L  = 0x0801,
    XBAR_OUT_MUX04_ADCAEVT3               = 0x0802,
    XBAR_OUT_MUX04_ECAP3_OUT              = 0x0803,
    XBAR_OUT_MUX05_CMPSS3_CTRIPOUTL       = 0x0A00,
    XBAR_OUT_MUX05_INPUTXBAR3             = 0x0A01,
    XBAR_OUT_MUX05_ADCCEVT3               = 0x0A03,
    XBAR_OUT_MUX06_CMPSS4_CTRIPOUTH       = 0x0C00,
    XBAR_OUT_MUX06_CMPSS4_CTRIPOUTH_OR_L  = 0x0C01,
    XBAR_OUT_MUX06_ADCAEVT4               = 0x0C02,
    XBAR_OUT_MUX06_ECAP4_OUT              = 0x0C03,
    XBAR_OUT_MUX07_CMPSS4_CTRIPOUTL       = 0x0E00,
    XBAR_OUT_MUX07_INPUTXBAR4             = 0x0E01,
    XBAR_OUT_MUX07_ADCCEVT4               = 0x0E03,
    XBAR_OUT_MUX08_CMPSS5_CTRIPOUTH       = 0x1000,
    XBAR_OUT_MUX08_CMPSS5_CTRIPOUTH_OR_L  = 0x1001,
    XBAR_OUT_MUX08_ADCBEVT1               = 0x1002,
    XBAR_OUT_MUX08_ECAP5_OUT              = 0x1003,
    XBAR_OUT_MUX09_CMPSS5_CTRIPOUTL       = 0x1200,
    XBAR_OUT_MUX09_INPUTXBAR5             = 0x1201,
    XBAR_OUT_MUX10_CMPSS6_CTRIPOUTH       = 0x1400,
    XBAR_OUT_MUX10_CMPSS6_CTRIPOUTH_OR_L  = 0x1401,
    XBAR_OUT_MUX10_ADCBEVT2               = 0x1402,
    XBAR_OUT_MUX10_ECAP6_OUT              = 0x1403,
    XBAR_OUT_MUX11_CMPSS6_CTRIPOUTL       = 0x1600,
    XBAR_OUT_MUX11_INPUTXBAR6             = 0x1601,
    XBAR_OUT_MUX12_CMPSS7_CTRIPOUTH       = 0x1800,
    XBAR_OUT_MUX12_CMPSS7_CTRIPOUTH_OR_L  = 0x1801,
    XBAR_OUT_MUX12_ADCBEVT3               = 0x1802,
    XBAR_OUT_MUX12_ECAP7_OUT              = 0x1803,
    XBAR_OUT_MUX13_CMPSS7_CTRIPOUTL       = 0x1A00,
    XBAR_OUT_MUX13_ADCSOCA                = 0x1A01,
    XBAR_OUT_MUX14_ADCBEVT4               = 0x1C02,
    XBAR_OUT_MUX14_EXTSYNCOUT             = 0x1C03,
    XBAR_OUT_MUX15_ADCSOCB                = 0x1E01,
    XBAR_OUT_MUX16_SD1FLT1_COMPH          = 0x2000,
    XBAR_OUT_MUX16_SD1FLT1_COMPH_OR_COMPL = 0x2001,
    XBAR_OUT_MUX17_SD1FLT1_COMPL          = 0x2200,
    XBAR_OUT_MUX17_CLAHALT                = 0x2203,
    XBAR_OUT_MUX18_SD1FLT2_COMPH          = 0x2400,
    XBAR_OUT_MUX18_SD1FLT2_COMPH_OR_COMPL = 0x2401,
    XBAR_OUT_MUX19_SD1FLT2_COMPL          = 0x2600,
    XBAR_OUT_MUX20_SD1FLT3_COMPH          = 0x2800,
    XBAR_OUT_MUX20_SD1FLT3_COMPH_OR_COMPL = 0x2801,
    XBAR_OUT_MUX21_SD1FLT3_COMPL          = 0x2A00,
    XBAR_OUT_MUX22_SD1FLT4_COMPH          = 0x2C00,
    XBAR_OUT_MUX22_SD1FLT4_COMPH_OR_COMPL = 0x2C01,
    XBAR_OUT_MUX23_SD1FLT4_COMPL          = 0x2E00,

} XBAR_OutputMuxConfig;

//*****************************************************************************
//
//! The following values define the \e muxConfig parameter for
//! XBAR_setEPWMMuxConfig().
//
//*****************************************************************************
typedef enum
{
    XBAR_EPWM_MUX00_CMPSS1_CTRIPH          = 0x0000,
    XBAR_EPWM_MUX00_CMPSS1_CTRIPH_OR_L     = 0x0001,
    XBAR_EPWM_MUX00_ADCAEVT1               = 0x0002,
    XBAR_EPWM_MUX00_ECAP1_OUT              = 0x0003,
    XBAR_EPWM_MUX01_CMPSS1_CTRIPL          = 0x0200,
    XBAR_EPWM_MUX01_INPUTXBAR1             = 0x0201,
    XBAR_EPWM_MUX01_ADCCEVT1               = 0x0203,
    XBAR_EPWM_MUX02_CMPSS2_CTRIPH          = 0x0400,
    XBAR_EPWM_MUX02_CMPSS2_CTRIPH_OR_L     = 0x0401,
    XBAR_EPWM_MUX02_ADCAEVT2               = 0x0402,
    XBAR_EPWM_MUX02_ECAP2_OUT              = 0x0403,
    XBAR_EPWM_MUX03_CMPSS2_CTRIPL          = 0x0600,
    XBAR_EPWM_MUX03_INPUTXBAR2             = 0x0601,
    XBAR_EPWM_MUX03_ADCCEVT2               = 0x0603,
    XBAR_EPWM_MUX04_CMPSS3_CTRIPH          = 0x0800,
    XBAR_EPWM_MUX04_CMPSS3_CTRIPH_OR_L     = 0x0801,
    XBAR_EPWM_MUX04_ADCAEVT3               = 0x0802,
    XBAR_EPWM_MUX04_ECAP3_OUT              = 0x0803,
    XBAR_EPWM_MUX05_CMPSS3_CTRIPL          = 0x0A00,
    XBAR_EPWM_MUX05_INPUTXBAR3             = 0x0A01,
    XBAR_EPWM_MUX05_ADCCEVT3               = 0x0A03,
    XBAR_EPWM_MUX06_CMPSS4_CTRIPH          = 0x0C00,
    XBAR_EPWM_MUX06_CMPSS4_CTRIPH_OR_L     = 0x0C01,
    XBAR_EPWM_MUX06_ADCAEVT4               = 0x0C02,
    XBAR_EPWM_MUX06_ECAP4_OUT              = 0x0C03,
    XBAR_EPWM_MUX07_CMPSS4_CTRIPL          = 0x0E00,
    XBAR_EPWM_MUX07_INPUTXBAR4             = 0x0E01,
    XBAR_EPWM_MUX07_ADCCEVT4               = 0x0E03,
    XBAR_EPWM_MUX08_CMPSS5_CTRIPH          = 0x1000,
    XBAR_EPWM_MUX08_CMPSS5_CTRIPH_OR_L     = 0x1001,
    XBAR_EPWM_MUX08_ADCBEVT1               = 0x1002,
    XBAR_EPWM_MUX08_ECAP5_OUT              = 0x1003,
    XBAR_EPWM_MUX09_CMPSS5_CTRIPL          = 0x1200,
    XBAR_EPWM_MUX09_INPUTXBAR5             = 0x1201,
    XBAR_EPWM_MUX10_CMPSS6_CTRIPH          = 0x1400,
    XBAR_EPWM_MUX10_CMPSS6_CTRIPH_OR_L     = 0x1401,
    XBAR_EPWM_MUX10_ADCBEVT2               = 0x1402,
    XBAR_EPWM_MUX10_ECAP6_OUT              = 0x1403,
    XBAR_EPWM_MUX11_CMPSS6_CTRIPL          = 0x1600,
    XBAR_EPWM_MUX11_INPUTXBAR6             = 0x1601,
    XBAR_EPWM_MUX12_CMPSS7_CTRIPH          = 0x1800,
    XBAR_EPWM_MUX12_CMPSS7_CTRIPH_OR_L     = 0x1801,
    XBAR_EPWM_MUX12_ADCBEVT3               = 0x1802,
    XBAR_EPWM_MUX12_ECAP7_OUT              = 0x1803,
    XBAR_EPWM_MUX13_CMPSS7_CTRIPL          = 0x1A00,
    XBAR_EPWM_MUX13_ADCSOCA                = 0x1A01,
    XBAR_EPWM_MUX14_ADCBEVT4               = 0x1C02,
    XBAR_EPWM_MUX14_EXTSYNCOUT             = 0x1C03,
    XBAR_EPWM_MUX15_ADCSOCB                = 0x1E01,
    XBAR_EPWM_MUX16_SD1FLT1_COMPH          = 0x2000,
    XBAR_EPWM_MUX16_SD1FLT1_COMPH_OR_COMPL = 0x2001,
    XBAR_EPWM_MUX17_SD1FLT1_COMPL          = 0x2200,
    XBAR_EPWM_MUX17_INPUTXBAR7             = 0x2201,
    XBAR_EPWM_MUX17_CLAHALT                = 0x2203,
    XBAR_EPWM_MUX18_SD1FLT2_COMPH          = 0x2400,
    XBAR_EPWM_MUX18_SD1FLT2_COMPH_OR_COMPL = 0x2401,
    XBAR_EPWM_MUX19_SD1FLT2_COMPL          = 0x2600,
    XBAR_EPWM_MUX19_INPUTXBAR8             = 0x2601,
    XBAR_EPWM_MUX20_SD1FLT3_COMPH          = 0x2800,
    XBAR_EPWM_MUX20_SD1FLT3_COMPH_OR_COMPL = 0x2801,
    XBAR_EPWM_MUX21_SD1FLT3_COMPL          = 0x2A00,
    XBAR_EPWM_MUX21_INPUTXBAR9             = 0x2A01,
    XBAR_EPWM_MUX22_SD1FLT4_COMPH          = 0x2C00,
    XBAR_EPWM_MUX22_SD1FLT4_COMPH_OR_COMPL = 0x2C01,
    XBAR_EPWM_MUX23_SD1FLT4_COMPL          = 0x2E00,
    XBAR_EPWM_MUX23_INPUTXBAR10            = 0x2E01,
    XBAR_EPWM_MUX25_INPUTXBAR11            = 0x3201,
    XBAR_EPWM_MUX27_INPUTXBAR12            = 0x3601,
    XBAR_EPWM_MUX29_INPUTXBAR13            = 0x3A01,
    XBAR_EPWM_MUX31_INPUTXBAR14            = 0x3E01
} XBAR_EPWMMuxConfig;

//*****************************************************************************
//
//! The following values define the \e inputFlag parameter for
//! XBAR_getInputFlagStatus() and XBAR_clearInputFlag().
//
//*****************************************************************************
typedef enum
{
    //
    // XBARFLG1
    //
    XBAR_INPUT_FLG_CMPSS1_CTRIPL    = 0x0000,
    XBAR_INPUT_FLG_CMPSS1_CTRIPH    = 0x0001,
    XBAR_INPUT_FLG_CMPSS2_CTRIPL    = 0x0002,
    XBAR_INPUT_FLG_CMPSS2_CTRIPH    = 0x0003,
    XBAR_INPUT_FLG_CMPSS3_CTRIPL    = 0x0004,
    XBAR_INPUT_FLG_CMPSS3_CTRIPH    = 0x0005,
    XBAR_INPUT_FLG_CMPSS4_CTRIPL    = 0x0006,
    XBAR_INPUT_FLG_CMPSS4_CTRIPH    = 0x0007,
    XBAR_INPUT_FLG_CMPSS5_CTRIPL    = 0x0008,
    XBAR_INPUT_FLG_CMPSS5_CTRIPH    = 0x0009,
    XBAR_INPUT_FLG_CMPSS6_CTRIPL    = 0x000A,
    XBAR_INPUT_FLG_CMPSS6_CTRIPH    = 0x000B,
    XBAR_INPUT_FLG_CMPSS7_CTRIPL    = 0x000C,
    XBAR_INPUT_FLG_CMPSS7_CTRIPH    = 0x000D,
    XBAR_INPUT_FLG_CMPSS1_CTRIPOUTL = 0x0010,
    XBAR_INPUT_FLG_CMPSS1_CTRIPOUTH = 0x0011,
    XBAR_INPUT_FLG_CMPSS2_CTRIPOUTL = 0x0012,
    XBAR_INPUT_FLG_CMPSS2_CTRIPOUTH = 0x0013,
    XBAR_INPUT_FLG_CMPSS3_CTRIPOUTL = 0x0014,
    XBAR_INPUT_FLG_CMPSS3_CTRIPOUTH = 0x0015,
    XBAR_INPUT_FLG_CMPSS4_CTRIPOUTL = 0x0016,
    XBAR_INPUT_FLG_CMPSS4_CTRIPOUTH = 0x0017,
    XBAR_INPUT_FLG_CMPSS5_CTRIPOUTL = 0x0018,
    XBAR_INPUT_FLG_CMPSS5_CTRIPOUTH = 0x0019,
    XBAR_INPUT_FLG_CMPSS6_CTRIPOUTL = 0x001A,
    XBAR_INPUT_FLG_CMPSS6_CTRIPOUTH = 0x001B,
    XBAR_INPUT_FLG_CMPSS7_CTRIPOUTL = 0x001C,
    XBAR_INPUT_FLG_CMPSS7_CTRIPOUTH = 0x001D,
    //
    // XBARFLG2
    //
    XBAR_INPUT_FLG_INPUT1     = 0x0100,
    XBAR_INPUT_FLG_INPUT2     = 0x0101,
    XBAR_INPUT_FLG_INPUT3     = 0x0102,
    XBAR_INPUT_FLG_INPUT4     = 0x0103,
    XBAR_INPUT_FLG_INPUT5     = 0x0104,
    XBAR_INPUT_FLG_INPUT6     = 0x0105,
    XBAR_INPUT_FLG_ADCSOCA    = 0x0106,
    XBAR_INPUT_FLG_ADCSOCB    = 0x0107,
    XBAR_INPUT_FLG_INPUT7     = 0x0108,
    XBAR_INPUT_FLG_INPUT8     = 0x0109,
    XBAR_INPUT_FLG_INPUT9     = 0x010A,
    XBAR_INPUT_FLG_INPUT10    = 0x010B,
    XBAR_INPUT_FLG_INPUT11    = 0x010C,
    XBAR_INPUT_FLG_INPUT12    = 0x010D,
    XBAR_INPUT_FLG_INPUT13    = 0x010E,
    XBAR_INPUT_FLG_INPUT14    = 0x010F,
    XBAR_INPUT_FLG_ECAP1_OUT  = 0x0110,
    XBAR_INPUT_FLG_ECAP2_OUT  = 0x0111,
    XBAR_INPUT_FLG_ECAP3_OUT  = 0x0112,
    XBAR_INPUT_FLG_ECAP4_OUT  = 0x0113,
    XBAR_INPUT_FLG_ECAP5_OUT  = 0x0114,
    XBAR_INPUT_FLG_ECAP6_OUT  = 0x0115,
    XBAR_INPUT_FLG_EXTSYNCOUT = 0x0116,
    XBAR_INPUT_FLG_ADCAEVT1   = 0x0117,
    XBAR_INPUT_FLG_ADCAEVT2   = 0x0118,
    XBAR_INPUT_FLG_ADCAEVT3   = 0x0119,
    XBAR_INPUT_FLG_ADCAEVT4   = 0x011A,
    XBAR_INPUT_FLG_ADCBEVT1   = 0x011B,
    XBAR_INPUT_FLG_ADCBEVT2   = 0x011C,
    XBAR_INPUT_FLG_ADCBEVT3   = 0x011D,
    XBAR_INPUT_FLG_ADCBEVT4   = 0x011E,
    XBAR_INPUT_FLG_ADCCEVT1   = 0x011F,
    //
    // XBARFLG3
    //
    XBAR_INPUT_FLG_ADCCEVT2      = 0x0200,
    XBAR_INPUT_FLG_ADCCEVT3      = 0x0201,
    XBAR_INPUT_FLG_ADCCEVT4      = 0x0202,
    XBAR_INPUT_FLG_ADCDEVT1      = 0x0203,
    XBAR_INPUT_FLG_ADCDEVT2      = 0x0204,
    XBAR_INPUT_FLG_ADCDEVT3      = 0x0205,
    XBAR_INPUT_FLG_ADCDEVT4      = 0x0206,
    XBAR_INPUT_FLG_SD1FLT1_COMPL = 0x0207,
    XBAR_INPUT_FLG_SD1FLT1_COMPH = 0x0208,
    XBAR_INPUT_FLG_SD1FLT2_COMPL = 0x0209,
    XBAR_INPUT_FLG_SD1FLT2_COMPH = 0x020A,
    XBAR_INPUT_FLG_SD1FLT3_COMPL = 0x020B,
    XBAR_INPUT_FLG_SD1FLT3_COMPH = 0x020C,
    XBAR_INPUT_FLG_SD1FLT4_COMPL = 0x020D,
    XBAR_INPUT_FLG_SD1FLT4_COMPH = 0x020E,
    XBAR_INPUT_FLG_ECAP7_OUT     = 0x0217,
    XBAR_INPUT_FLG_SD1FLT1_COMPZ = 0x0218,
    XBAR_INPUT_FLG_SD1FLT1_DRINT = 0x0219,
    XBAR_INPUT_FLG_SD1FLT2_COMPZ = 0x021A,
    XBAR_INPUT_FLG_SD1FLT2_DRINT = 0x021B,
    XBAR_INPUT_FLG_SD1FLT3_COMPZ = 0x021C,
    XBAR_INPUT_FLG_SD1FLT3_DRINT = 0x021D,
    XBAR_INPUT_FLG_SD1FLT4_COMPZ = 0x021E,
    XBAR_INPUT_FLG_SD1FLT4_DRINT = 0x021F,
    //
    // XBARFLG4
    //
    XBAR_INPUT_FLG_ERRORSTS = 0x031C
} XBAR_InputFlag;
#endif

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! Enables the Output X-BAR mux values to be passed to the output signal.
//!
//! \param output is the X-BAR output being configured.
//! \param muxes is a bit field of the muxes to be enabled.
//!
//! This function enables the mux values to be passed to the X-BAR output
//! signal. The \e output parameter is a value \b XBAR_OUTPUTy where y is
//! the output number between 1 and 8 inclusive.
//!
//! The \e muxes parameter is a bit field of the muxes being enabled where bit
//! 0 represents mux 0, bit 1 represents mux 1 and so on. Defines are provided
//! in the form of \b XBAR_MUXnn that can be OR'd together to enable several
//! muxes on an output at the same time. For example, passing this function
//! ( \b XBAR_MUX04 | \b XBAR_MUX10 ) would enable muxes 4 and 10.
//!
//! \return None.
//
//*****************************************************************************
static inline void XBAR_enableOutputMux(XBAR_OutputNum output, uint32_t muxes)
{
    //
    // Set the enable bit.
    //
    EALLOW;

